Revit 2027 API
ElectricalLoadClassification.PanelConnectedLabel Property
 The name template for the connected load parameter of the load classification.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string PanelConnectedLabel { get; set; }
Public Property PanelConnectedLabel As String
	Get
	Set
public:
property String^ PanelConnectedLabel {
	String^ get ();
	void set (String^ value);
}
member PanelConnectedLabel : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentException |  When setting this property: panelConnectedLabel is not a valid globalization format string.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ElectricalLoadClassification Class
Autodesk.Revit.DB.Electrical Namespace